{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
      "workspace": {
        "type": "String"
      },
      "rule-name": {
        "type": "string",
        "defaultValue": "AO-ALL-[EDR][Defender] Same detection in multiple hosts​"
      },
      "analytic-id": {
        "type": "string",
        "defaultValue": "[guid(parameters('workspace'),parameters('rule-name'))]",
        "minLength": 1,
        "metadata": {
          "description": "Unique id for the scheduled alert rule"
        }
      }
    },
    "resources": [
      {
        "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
        "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/',parameters('analytic-id'))]",
        "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/',parameters('analytic-id'))]",
        "apiVersion": "2020-01-01",
        "kind": "Scheduled",
        "location": "[resourceGroup().location]",
        "properties": {
                "displayName": "[concat(parameters('rule-name'),' ',parameters('analytic-id'))]",
                "description": "¿Qué queremos detectar? - Una misma alerta de seguridad en multitud de equipos distintos\n¿Cómo lo queremos detectar? - Monitorizando las alertas que genera la herramienta EDR y agrupándolas por el mismo tipo de alerta (malware, exploit, ransomware, PUP...) en varios equipos distintos de la organización \n¿Por qué lo queremos detectar? - Esto podría significar que varios equipos de la compañía han sido infectados con el mismo malware, el cual podría estar moviéndose a través de la red o haber entrado por un mismo vector de entrada (phising, vulnerabilidad, mala configuración...)",
                "severity": "Medium",
                "enabled": true,
                "query": "SecurityAlert\r\n| where ProductName == \"Microsoft Defender Advanced Threat Protection\" and AlertSeverity != \"Informational\"\r\n| extend Entity = parse_json(Entities), parse_json(ExtendedProperties)\r\n| mv-expand Entity\r\n| extend HostName = tostring(Entity.HostName), XDR_IncidentID = tostring(ExtendedProperties.IncidentId), User = tostring(Entity.LoggedOnUsers[0].AccountName), HostIP = tostring(Entity.LastIpAddress.Address), Category = tostring(ExtendedProperties.Category), ThreatName = tostring(ExtendedProperties.ThreatName)\r\n| where isnotempty(HostName)\r\n| project TimeGenerated, AlertName, Description, XDR_IncidentID, AlertSeverity, HostName, User, HostIP, Category, ThreatName\r\n| join kind=inner ( \r\n    SecurityAlert\r\n    | where ProductName == \"Microsoft Defender Advanced Threat Protection\" and AlertSeverity != \"Informational\"\r\n    | extend Entity = parse_json(Entities), parse_json(ExtendedProperties)\r\n    | mv-expand Entity\r\n    | extend HostName = tostring(Entity.HostName), XDR_IncidentID = tostring(ExtendedProperties.IncidentID)\r\n    | where isnotempty(HostName)\r\n    | summarize EntityCount = dcount(HostName) by AlertName\r\n    | where EntityCount >=3\r\n) on AlertName",
                "queryFrequency": "PT1H",
                "queryPeriod": "P3D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "Execution"
                ],
                "techniques": [
                    "T1059",
                    "T0863"
                ],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT8H",
                        "matchingMethod": "Selected",
                        "groupByEntities": [],
                        "groupByAlertDetails": [
                            "DisplayName"
                        ],
                        "groupByCustomDetails": [
                            "AlertName"
                        ]
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "AlertPerResult"
                },
                "alertDetailsOverride": {
                    "alertDynamicProperties": []
                },
                "customDetails": {
                    "AlertName": "AlertName",
                    "Category": "Category",
                    "Severity": "AlertSeverity",
                    "Defender_IncidentId": "XDR_IncidentID"
                },
                "entityMappings": [
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "HostName",
                                "columnName": "HostName"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "HostIP"
                            }
                        ]
                    },
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "User"
                            }
                        ]
                    },
                    {
                        "entityType": "Malware",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "ThreatName"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}
