{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e5097bac-7f8e-47c2-9518-7e0048b643c1')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e5097bac-7f8e-47c2-9518-7e0048b643c1')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "MDR-AO-PRI-003-[WOS] Potential Privilege Escalation via Bypass UAC",
                "description": "[Detección de intrusión-PE-DE-T1548.002]\nAdversaries may bypass UAC mechanisms to elevate process privileges on system. Windows User Account Control (UAC) allows a program to elevate its privileges (tracked as integrity levels ranging from low to high) to perform a task under administrator-level permissions, possibly by prompting the user for confirmation. The impact to the user ranges from denying the operation under high enforcement to allowing the user to perform the action if they are in the local administrators group and click through the prompt or allowing them to enter an administrator password to complete the action.",
                "severity": "High",
                "enabled": true,
                "query": "// T1548 - Abuse Elevation Control Mechanism: Bypass User Account Control\n// Reference: https://attack.mitre.org/techniques/T1548/002/\nDeviceRegistryEvents\n| where InitiatingProcessFileName in (\"cmd.exe\", \"reg.exe\", \"Powershell.exe\")\n| where (InitiatingProcessCommandLine contains \"add hkcu\\\\software\\\\classes\\\\mscfile\\\\shell\\\\open\\\\command\" \nor InitiatingProcessCommandLine contains \"delete hkcu\\\\software\\\\classes\\\\mscfile\" \nor InitiatingProcessCommandLine contains \"New-Item \\\"HKCU:\\\\software\\\\classes\\\\mscfile\\\\shell\\\\open\\\\command\\\"\" \nor InitiatingProcessCommandLine contains \"Set-ItemProperty \\\"HKCU:\\\\software\\\\classes\\\\mscfile\\\\shell\\\\open\\\\command\\\"\" \nor InitiatingProcessCommandLine contains \"Remove-Item \\\"HKCU:\\\\software\\\\classes\\\\mscfile\\\"\" \nor InitiatingProcessCommandLine contains \"add hkcu\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\" \nor InitiatingProcessCommandLine contains \"delete hkcu\\\\software\\\\classes\\\\ms-settings\"\nor InitiatingProcessCommandLine contains \"New-Item \\\"HKCU:\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\\\"\"\nor InitiatingProcessCommandLine contains \"New-ItemProperty \\\"HKCU:\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\\\"\"\nor InitiatingProcessCommandLine contains \"Remove-Item \\\"HKCU:\\\\software\\\\classes\\\\ms-settings\\\"\"\nor InitiatingProcessCommandLine contains \"New-Item -Force -Path \\\"HKCU:\\\\Software\\\\Classes\\\\Folder\\\\shell\\\\open\\\\command\\\"\"\nor InitiatingProcessCommandLine contains \"New-ItemProperty -Force -Path \\\"HKCU:\\\\Software\\\\Classes\\\\Folder\\\\shell\\\\open\\\\command\\\"\"\nor InitiatingProcessCommandLine contains \"Remove-Item -Path \\\"HKCU:\\\\Software\\\\Classes\\\\Folder\\\"\"\nor InitiatingProcessCommandLine contains \"ADD HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\"\nor InitiatingProcessCommandLine contains \"DELETE HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\") \nor (ActionType in (\"RegistryKeyCreated\", \"RegistryValueSet\") \nand (PreviousRegistryKey contains \"hkcu\\\\software\\\\classes\\\\mscfile\\\\shell\\\\open\\\\command\" \nor PreviousRegistryKey contains \"hkcu\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\" \nor PreviousRegistryValueData contains \"hkcu\\\\software\\\\classes\\\\mscfile\\\\shell\\\\open\\\\command\" \nor PreviousRegistryValueName contains \"hkcu\\\\software\\\\classes\\\\mscfile\\\\shell\\\\open\\\\command\" \nor PreviousRegistryValueData contains \"hkcu\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\" \nor PreviousRegistryValueName contains \"hkcu\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\"\nor PreviousRegistryKey contains \"HKCU:\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\"\nor PreviousRegistryValueData contains \"HKCU:\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\"\nor PreviousRegistryValueName contains \"HKCU:\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\"\nor PreviousRegistryKey contains \"HKCU:\\\\Software\\\\Classes\\\\Folder\\\\shell\\\\open\\\\command\"\nor PreviousRegistryValueData contains \"HKCU:\\\\Software\\\\Classes\\\\Folder\\\\shell\\\\open\\\\command\"\nor PreviousRegistryValueName contains \"HKCU:\\\\Software\\\\Classes\\\\Folder\\\\shell\\\\open\\\\command\"\nor PreviousRegistryKey contains \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\"\nor PreviousRegistryValueData contains \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\"\nor PreviousRegistryValueName contains \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\")) \nor (ActionType in (\"RegistryValueDeleted\", \"RegistryKeyDeleted\") \nand (PreviousRegistryKey contains \"hkcu\\\\software\\\\classes\\\\mscfile\" \nor PreviousRegistryKey contains \"hkcu\\\\software\\\\classes\\\\ms-settings\"\nor PreviousRegistryValueName contains \"hkcu\\\\software\\\\classes\\\\mscfile\"\nor PreviousRegistryValueData contains \"hkcu\\\\software\\\\classes\\\\mscfile\"\nor PreviousRegistryValueName contains \"hkcu\\\\software\\\\classes\\\\ms-settings\"\nor PreviousRegistryValueData contains \"hkcu\\\\software\\\\classes\\\\ms-settings\"\nor PreviousRegistryKey contains \"HKCU:\\\\software\\\\classes\\\\ms-settings\"\nor PreviousRegistryValueData contains \"HKCU:\\\\software\\\\classes\\\\ms-settings\"\nor PreviousRegistryValueName contains \"HKCU:\\\\software\\\\classes\\\\ms-settings\"\nor PreviousRegistryKey contains \"HKCU:\\\\Software\\\\Classes\\\\Folder\"\nor PreviousRegistryValueData contains \"HKCU:\\\\Software\\\\Classes\\\\Folder\"\nor PreviousRegistryValueName contains \"HKCU:\\\\Software\\\\Classes\\\\Folder\"\nor PreviousRegistryKey contains \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\"\nor PreviousRegistryValueData contains \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\"\nor PreviousRegistryValueName contains \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\"))\n| union (DeviceProcessEvents\n| where FileName in (\"cmd.exe\", \"reg.exe\", \"Powershell.exe\")\n| where (ProcessCommandLine contains \"add hkcu\\\\software\\\\classes\\\\mscfile\\\\shell\\\\open\\\\command\" \nor ProcessCommandLine contains \"delete hkcu\\\\software\\\\classes\\\\mscfile\" \nor ProcessCommandLine contains \"New-Item \\\"HKCU:\\\\software\\\\classes\\\\mscfile\\\\shell\\\\open\\\\command\\\"\" \nor ProcessCommandLine contains \"Set-ItemProperty \\\"HKCU:\\\\software\\\\classes\\\\mscfile\\\\shell\\\\open\\\\command\\\"\" \nor ProcessCommandLine contains \"Remove-Item \\\"HKCU:\\\\software\\\\classes\\\\mscfile\\\"\" \nor ProcessCommandLine contains \"add hkcu\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\" \nor ProcessCommandLine contains \"delete hkcu\\\\software\\\\classes\\\\ms-settings\"\nor ProcessCommandLine contains \"New-Item \\\"HKCU:\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\\\"\"\nor ProcessCommandLine contains \"New-ItemProperty \\\"HKCU:\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\\\"\"\nor ProcessCommandLine contains \"Remove-Item \\\"HKCU:\\\\software\\\\classes\\\\ms-settings\\\"\"\nor ProcessCommandLine contains \"New-Item -Force -Path \\\"HKCU:\\\\Software\\\\Classes\\\\Folder\\\\shell\\\\open\\\\command\\\"\"\nor ProcessCommandLine contains \"New-ItemProperty -Force -Path \\\"HKCU:\\\\Software\\\\Classes\\\\Folder\\\\shell\\\\open\\\\command\\\"\"\nor ProcessCommandLine contains \"Remove-Item -Path \\\"HKCU:\\\\Software\\\\Classes\\\\Folder\\\"\"\nor ProcessCommandLine contains \"ADD HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\"\nor ProcessCommandLine contains \"DELETE HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\")\n)\n| union (SecurityEvent\n| where Process in (\"cmd.exe\", \"reg.exe\", \"Powershell.exe\")\n| where (CommandLine contains \"add hkcu\\\\software\\\\classes\\\\mscfile\\\\shell\\\\open\\\\command\" \nor CommandLine contains \"delete hkcu\\\\software\\\\classes\\\\mscfile\" \nor CommandLine contains \"New-Item \\\"HKCU:\\\\software\\\\classes\\\\mscfile\\\\shell\\\\open\\\\command\\\"\" \nor CommandLine contains \"Set-ItemProperty \\\"HKCU:\\\\software\\\\classes\\\\mscfile\\\\shell\\\\open\\\\command\\\"\" \nor CommandLine contains \"Remove-Item \\\"HKCU:\\\\software\\\\classes\\\\mscfile\\\"\" \nor CommandLine contains \"add hkcu\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\" \nor CommandLine contains \"delete hkcu\\\\software\\\\classes\\\\ms-settings\"\nor CommandLine contains \"New-Item \\\"HKCU:\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\\\"\"\nor CommandLine contains \"New-ItemProperty \\\"HKCU:\\\\software\\\\classes\\\\ms-settings\\\\shell\\\\open\\\\command\\\"\"\nor CommandLine contains \"Remove-Item \\\"HKCU:\\\\software\\\\classes\\\\ms-settings\\\"\"\nor CommandLine contains \"New-Item -Force -Path \\\"HKCU:\\\\Software\\\\Classes\\\\Folder\\\\shell\\\\open\\\\command\\\"\"\nor CommandLine contains \"New-ItemProperty -Force -Path \\\"HKCU:\\\\Software\\\\Classes\\\\Folder\\\\shell\\\\open\\\\command\\\"\"\nor CommandLine contains \"Remove-Item -Path \\\"HKCU:\\\\Software\\\\Classes\\\\Folder\\\"\"\nor CommandLine contains \"ADD HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\"\nor CommandLine contains \"DELETE HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\")\n)\n| summarize entries = makelist(pack_all()) by InitiatingProcessCommandLine = ProcessCommandLine, AccountDomain = DeviceName, AccountName = InitiatingProcessAccountName\n",
                "queryFrequency": "PT5M",
                "queryPeriod": "PT5M",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "PrivilegeEscalation",
                    "DefenseEvasion"
                ],
                "techniques": [],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT1H",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Account"
                        ],
                        "groupByAlertDetails": [
                            "DisplayName"
                        ],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "HostName",
                                "columnName": "AccountDomain"
                            }
                        ]
                    },
                    {
                        "entityType": "Process",
                        "fieldMappings": [
                            {
                                "identifier": "CommandLine",
                                "columnName": "InitiatingProcessCommandLine"
                            }
                        ]
                    },
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "AccountName"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}